#
# Скрипт для учебного пособия "Введение в R"
#
# Суязова (Аксюк) Светлана Андреевна s.a.askuk@gmail.com
# версия скрипта: 1.0 (20.09.2018)
#
# версия R:
# R.version
###                _                           
### platform       x86_64-w64-mingw32          
### arch           x86_64                      
### os             mingw32                     
### system         x86_64, mingw32             
### status                                     
### major          3                           
### minor          5.1                         
### year           2018                        
### month          07                          
### day            02                          
### svn rev        74947                       
### language       R                           
### version.string R version 3.5.1 (2018-07-02)
### nickname       Feather Spray       


# 1. Знакомство с языком R и интерфейсом RStudio -------------------------------


# 1.1 Настройка рабочей директории =============================================

# узнать рабочую директорию
getwd()

# установить рабочую директорию
setwd("E:/My Documents/R-work/")
# другой возможный вариант
setwd('E:\\My Documents\\R-work\\')

# версия R
R.version


# 1.2 Простая арифметика =======================================================

# сложим три числа
1 + 2 + 4

# любые другие арифметические операции
7 * 8
1 / 2
1 - 0.0
1 - 9*10^(-8)
1 - 9*10^(-9)


# 1.3 Создание числового вектора ===============================================

x <- c(177, 152, 164)
x

# пробуем найти сумму x и 160:
x + 160

x[1] + x[2] + x[3] + 160
sum(c(x, 160))
sum(c(x, 160)) / 4

sin(42)
sin(c(0, pi/2, 3*pi/2, 2*pi))
round(sin(c(0, pi/2, 3*pi/2, 2*pi)), 4)


# 1.4 Просмотр структуры объекта ===============================================

str(x)

# ядро генератора случайных чисел
set.seed(42)
x <- rnorm(n = 15)  # x = 15 значений случ. величины N~(0, 1)
y <- rnorm(n = 15)  # y тоже
xy.correlation <- cor.test(x, y)     # корреляция x и y
str(xy.correlation)                  # смотрим структуру


# 1.5 Вызов справки ============================================================

help(str)

?str

??structure

RSiteSearch('structure')

help.start()
