#
# Скрипт для учебного пособия "Введение в R"
#
# Суязова (Аксюк) Светлана Андреевна s.a.askuk@gmail.com
# версия скрипта: 1.0 (20.09.2018)
#
# версия R:
# R.version
###                _                           
### platform       x86_64-w64-mingw32          
### arch           x86_64                      
### os             mingw32                     
### system         x86_64, mingw32             
### status                                     
### major          3                           
### minor          5.1                         
### year           2018                        
### month          07                          
### day            02                          
### svn rev        74947                       
### language       R                           
### version.string R version 3.5.1 (2018-07-02)
### nickname       Feather Spray       


# 1. Знакомство с языком R и интерфейсом RStudio -------------------------------


# 1.1 Настройка рабочей директории =============================================

# узнать рабочую директорию


# установить рабочую директорию в директорию скрипта:
#  Меню Session -> Set Working Directory -> To Source File Location

# версия R
R.version


# 1.2 Простая арифметика =======================================================

# сложим три числа


# любые другие арифметические операции
7 * 8
1 / 2
1 - 0.0
1 - 9*10^(-8)
1 - 9*10^(-9)


# 1.3 Создание числового вектора ===============================================

x <- 
x

# пробуем найти сумму x и 160:






# векторизация на примере функций sin, round:




# 1.4 Просмотр структуры объекта ===============================================



# ядро генератора случайных чисел

# x = 15 значений случ. величины N~(0, 1)
x <-                
# y тоже
y <-   
# корреляция x и y
xy.correlation <- cor.test(x, y)     
# смотрим структуру
str(xy.correlation)                  


# 1.5 Вызов справки ============================================================

help(str)

?str

??structure

RSiteSearch('structure')

help.start()
