# Esly russkie bukvy ne otobrajautsa: File -> Reopen with encoding... UTF-8

# Установить кодировку в RStudio: Tools -> Global Options -> General, 
#  Default text encoding: UTF-8

# ..............................................................................
# Практикум на ЭВМ 4: Практика 1
#
#  * базовые структуры данных: векторы, матрицы, списки, фреймы   
#  * последовательности   
#  * встроенные функции для расчёта описательных статистик   
#  * вызов справки  
# ..............................................................................




