# Esly russkie bukvy ne otobrajautsa: File -> Reopen with encoding... UTF-8

# Используйте UTF-8 как кодировку по умолчанию!
# Установить кодировку в RStudio: Tools -> Global Options -> General, 
#  Default text encoding: UTF-8

# ..............................................................................
# Практикум на ЭВМ 4. Практика 1: Основы  
# ..............................................................................



# Типы переменных --------------------------------------------------------------


# слайд 10 =====================================================================

typeof(42)
is.integer(42)

typeof(integer(42))
typeof(6.5)


# слайд 11 =====================================================================

typeof("Практикум на ЭВМ 4")
typeof('Дисциплина "Практикум на ЭВМ 4"')
typeof('42')


# слайд 12 =====================================================================

2 == '2'
'осень' != 'лето'



# Структуры данных -------------------------------------------------------------


# слайд 13 =====================================================================

x <- c(1, 1, 2, 3)
typeof(x)
    
y <- c(TRUE, 1, '2', "3")
typeof(y)

x == y


# слайд 14 =====================================================================

x.matrix <- matrix(c(1, 2, 3, 4, 5, 6), 2, 3)

x.matrix

dim(x.matrix)


# слайд 15 =====================================================================

my.list <- list(index.name = "ВВП РФ, трлн долл.", 
                year = 2014:2017, value = c(2.06, 1.37, 1.28, 1.58))
my.list


# слайд 16 =====================================================================

df.2019 <- data.frame(city = c("Москва", "Воронеж",
                               "Липецк"),
                      popul.mln = c(12.5, 1.1, 0.6),
                      area.sq.km = c(2561.5, 596.51, 330.15))
df.2019


# слайд 17 =====================================================================

str(df.2019)
colnames(df.2019)

# слайд 18 =====================================================================

df.2019 <- data.frame(city = c("Москва", "Воронеж",
                               "Липецк"),
                      popul.mln = c(12.5, 1.1, 0.6),
                      area.sq.km = c(2561.5, 596.51, 330.15),
                      stringsAsFactors = F)
str(df.2019)


# слайд 19 =====================================================================

df.2019$city
df.2019$city[1]


# слайд 20 =====================================================================

df.2019[1, ]   # выбрать первую строку фрейма 
df.2019[, 1]   # выбрать первый столбец фрейма
df.2019[1, 2]  # выбрать элемент из строки 1, столбца 2


# слайд 21 =====================================================================

df.2019[, 2:3] # выбрать второй и третий столбцы фрейма
df.2019[, c('popul.mln', 'area.sq.km')] #по именам столбцов


# слайд 22 =====================================================================

# проверить, в каких городах население больше миллиона
df.2019$popul.mln > 1
# номера элементов вектора, удовлетворяющих условию
which(df.2019$popul.mln > 1)


# слайд 23 =====================================================================

x <- c(1, -2, 3, -4)
# увеличить все элементы вектора на 1
y <- x + 1
# вывести результат
y 

# увеличить только положительные элементы вектора на 2
x[x > 0] <- x[x > 0] + 2
# вывести результат
x


# слайд 24 =====================================================================

apply(df.2019[, 2:3], 2, mean)
sapply(df.2019[, 2:3], mean)


# слайд 25 =====================================================================

lapply(df.2019, mean)


# слайд 26 =====================================================================

# вызов справки по функции apply 
?apply

# поиск по сайту проекта (открывается в браузере)
RSiteSearch('apply')
