# Esly russkie bukvy ne otobrajautsa: File -> Reopen with encoding... UTF-8

# Используйте UTF-8 как кодировку по умолчанию!
# Установить кодировку в RStudio: Tools -> Global Options -> General, 
#  Default text encoding: UTF-8

# ..............................................................................
# Практикум на ЭВМ 4. Практика 4: Предварительный анализ данных  
#
#  * Графики разброса  
#  * Описательные статистики
#  * Корреляционный анализ  
# ..............................................................................


# Загрузка данных --------------------------------------------------------------

# Загрузка библиотек
library('Hmisc')          # для расчёта корреляционной матрицы
library('corrplot')       # визуализация корреляционных матриц: corrplot()
library('nortest')        # для теста Андерсона-Дарлинга ad.test()

# импорт данных из .csv
DF <- read.csv2('./slides_practice_04_files/Пример_алкоголь-2011.csv',
                row.names = 1, stringsAsFactors = F, na.strings = 'NA')
DF$FO <- as.factor(DF$FO)

# чтобы отчёты помещались на слайде, придётся переименовать один показатель
colnames(DF)[colnames(DF) == "Retail.Vodka.2011.ps"] <- "Ret.Vodka.2011.ps"

# оставляем только регионы и выбрасываем столбец меток, 
#  чтобы удобнее было считать
reg.df <- DF[as.numeric(row.names(DF)) < 1000, -1]
# выбрасываем пропущенные
reg.df <- na.omit(reg.df)


# слайд 4 ======================================================================

head(reg.df, n = 3)
str(reg.df)


# слайд 5 ======================================================================

# ручной расчёт
#  средние арифметические
mns <- round(apply(reg.df[, 2:5], 2, mean), 1)
#  стандартные отклонения
sds <- round(apply(reg.df[, 2:5], 2, sd), 1)
#  коэффициенты вариации
coef.vars <- round(sds/mns*100, 1)

# делаем свою таблицу только с нужными статистиками 
#  по количественным показателям: среднее, СКО, коэффициент вариации
smm <- rbind(mns, sds, coef.vars)     # соединить как строки
# названия статистик -- заголовки строк
row.names(smm) <- c('Среднее', 'Стандартное отклонение',
                    'Коэффициент вариации, %')
smm


# слайд 6 ======================================================================

# строим гистограммы на одном полотне 
par(mfrow = c(2, 2))           # разбить полотно на 4 части, 2x2
par(oma = c(0, 0, 1.5, 0))     # внешние поля общего полотна
par(mar = c(4, 4, 0.5, 0.5))   # внутренние поля каждого графика

# цикл по номерам столбцов с количественными переменными
for (i in 2:5) {
    # данные -- i-ый столбец фрейма
    x <- reg.df[, i]
    
    # гистограмма
    hist(x,
         freq = F,            # по вертикали – плотность (доля)
         col = 'wheat',       # цвет заливки
         xlab = colnames(reg.df)[i],     # название оси X – название столбца 
         ylab = 'Плотность',             # название оси Y
         main = '')                      # без заголовка
    
    # теоретическая плотность
    curve(dnorm(x, mean = mean(x), sd = sd(x)), col = 'darkblue', 
          lwd = 2, add = TRUE)
}

# общий заголовок для всех графиков
title(main = 'Гистограммы распределения показателей', 
      outer = TRUE, cex = 1.5)

# вернуть настройки обратно, 1x1
par(mfrow = c(1, 1))


# слайд 7 ======================================================================

# тест Шапиро-Уилка на нормальность распределения
shapiro.test(reg.df$Ret.Vodka.2011.ps)


# слайд 8 ======================================================================

# тест Шапиро-Уилка на нормальность распределения (все столбцы)
apply(reg.df[, 2:5], 2, function (x) {
    round(shapiro.test(x)$p.value, 2)
})


# слайд 9 ======================================================================

# матричные графики разброса 
pairs(reg.df[, -1],     # фрейм без первого столбца-фактора
      pch = 21,         # тип символов для точек
      col = rgb(0, 0, 1, alpha = 0.4),   # цвет заливки точек
      bg = rgb(0, 0, 1, alpha = 0.4),    # цвет границы точек
      cex = 1.1)                 # масштаб символов для точек


# слайд 10 =====================================================================

# матричные графики разброса с линиями регрессии и коэффициентами корреляции
# source: https://stackoverflow.com/questions/49289258/how-to-draw-regression-line-instead-of-lowess-line-in-pairs-in-r  
reg <- function(x, y, col) abline(lm(y~x), col=col) 

panel.cor <- function(x, y, digits = 2, prefix = "", cex.cor, ...) {
    usr <- par("usr"); on.exit(par(usr))
    par(usr = c(0, 1, 0, 1))
    r <- abs(cor(x, y))
    txt <- format(c(r, 0.123456789), digits = digits)[1]
    txt <- paste0(prefix, txt)
    text(0.5, 0.5, txt, cex = 1.1, font = 4)
}

panel.lm =  function (x, y, col = par("col"), bg = NA, pch = par("pch"), 
                      cex = 1, col.smooth = "red", span = 2/3, iter = 3, ...)  {
    points(x, y, pch = pch, col = col, bg = bg, cex = cex)
    ok <- is.finite(x) & is.finite(y)
    if (any(ok)) reg(x[ok], y[ok], col.smooth)
}

pairs(reg.df[, -1], panel = panel.lm,
      cex = 1.5, pch = 19, col = adjustcolor(4, .4), cex.labels = 2, 
      font.labels = 2, lower.panel = panel.cor)


# слайд 11 =====================================================================

# тот же график на логарифмах
pairs(log(reg.df[, -1]), panel = panel.lm,
      cex = 1.5, pch = 19, col = adjustcolor(4, .4), cex.labels = 2, 
      font.labels = 2, lower.panel = panel.cor)


# слайд 12 =====================================================================

# Корреляционная матрица с P-значениями
rcorr(as.matrix(reg.df[, -1]))


# слайд 13 =====================================================================

# сохраняем корреляционную матрицу
matrix.cor <- cor(reg.df[, -1])

# сохраняем p-значения
matrix.p <- rcorr(as.matrix(reg.df[, -1]))$P

# изображаем матрицу графически
corrplot(matrix.cor,          # сама корреляционная матрица
         order = 'original',  # порядок отображения показателей 
         # в матрице
         diag = F,            # не отображать значения на главной 
         # диагонали
         p.mat = matrix.p,    # p-значения
         insig = 'blank',     # метод отображения незначимых
         sig.level = 0.05)    # уровень значимости
